In [1]:
import pandas as pd

In [2]:
castCrewSelections = pd.read_pickle('v1_castCrewSelections.pkl')

castCrewSelections.shape

(122068, 23)

In [3]:
movieSelections95Pct = pd.read_pickle('v1_movieSelections95Pct.pkl')

movieSelections95Pct.shape

(4532, 12)

In [4]:
castCrewSelections95Pct = castCrewSelections.merge(movieSelections95Pct, left_on='tconst', right_on='tconst', how='inner')

castCrewSelections95Pct.shape

(21276, 34)

In [5]:
castCrewSelections95Pct.head()

,tconst,ordering,nconst,category,job,characters,primaryName,birthYear,deathYear,primaryProfession,...,primaryTitle_y,originalTitle_y,isAdult_y,startYear_y,endYear_y,runtimeMinutes_y,genres_y,titleId_y,averageRating_y,numVotes_y
0,tt0029843,2,nm0000014,actress,\N,"[""Maid Marian""]",Olivia de Havilland,1916,\N,"actress,soundtrack",...,The Adventures of Robin Hood,The Adventures of Robin Hood,0,1938,\N,102,"Action,Adventure,Romance",tt0029843,8.0,42316
1,tt0061809,1,nm0086706,actor,\N,"[""Perry""]",Robert Blake,1933,\N,"actor,writer,producer",...,In Cold Blood,In Cold Blood,0,1967,\N,134,"Biography,Crime,Drama",tt0061809,8.0,21252
2,tt0061809,2,nm0934113,actor,\N,"[""Dick""]",Scott Wilson,1942,\N,actor,...,In Cold Blood,In Cold Blood,0,1967,\N,134,"Biography,Crime,Drama",tt0061809,8.0,21252
3,tt0113845,4,nm0086706,actor,\N,"[""Donald Patterson""]",Robert Blake,1933,\N,"actor,writer,producer",...,Money Train,Money Train,0,1995,\N,110,"Action,Comedy,Crime",tt0113845,5.6,35160
4,tt0113845,5,nm0747849,director,\N,\N,Joseph Ruben,1950,\N,"director,writer,producer",...,Money Train,Money Train,0,1995,\N,110,"Action,Comedy,Crime",tt0113845,5.6,35160

In [6]:
actorSelections95Pct = castCrewSelections95Pct[castCrewSelections95Pct.category == 'actor']
actorSelections95Pct.shape

(9557, 34)

In [7]:
actorSelections95PctAgg = (actorSelections95Pct.groupby('primaryName')
   .agg({'tconst':'count', 'averageRating_y': 'mean'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
actorSelections95PctAgg.shape

(2772, 3)

In [8]:
actorSelections95PctAgg.head()

           primaryName  tconst  averageRating_y
0  'Weird Al' Yankovic       1             7.00
1              50 Cent       5             5.86
2   A. Michael Baldwin       1             6.80
3             AJ Bowen       1             6.50
4           Aamir Khan       3             7.30

In [9]:
actorSelections95PctAgg = actorSelections95PctAgg[actorSelections95PctAgg.tconst > 10]
actorSelections95PctAgg.shape

(209, 3)

In [10]:
actorSelections95PctAgg.sort_values('averageRating_y', ascending=False, inplace=True)

# Top 10 Actors Ranked by Highest Movie Rating With 10 or More Films

In [11]:
actorSelections95PctAgg.head(10)

            primaryName  tconst  averageRating_y
995        Ian McKellen      14         7.628571
1587  Leonardo DiCaprio      19         7.536842
2236       Ryan Gosling      19         7.278947
398        Chris Cooper      11         7.272727
425      Christian Bale      24         7.254167
273           Brad Pitt      34         7.214706
1511       Kevin Spacey      21         7.214286
2161  Robert Downey Jr.      25         7.200000
553    Daniel Radcliffe      13         7.184615
710      Dustin Hoffman      24         7.183333

In [12]:
actressSelections95Pct = castCrewSelections95Pct[castCrewSelections95Pct.category == 'actress']
actressSelections95Pct.shape

(5490, 34)

In [13]:
actressSelections95PctAgg = (actressSelections95Pct.groupby('primaryName')
   .agg({'tconst':'count', 'averageRating_y': 'mean'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
actressSelections95PctAgg.shape

(1980, 3)

In [14]:
actressSelections95PctAgg.head()

       primaryName  tconst  averageRating_y
0        A.J. Cook       1         6.200000
1      A.J. Langer       1         6.300000
2      AJ Michalka       1         7.000000
3    Abbie Cornish       7         6.414286
4  Abigail Breslin      11         6.845455

In [15]:
actressSelections95PctAgg = actressSelections95PctAgg[actressSelections95PctAgg.tconst > 10]
actressSelections95PctAgg.shape

(102, 3)

In [16]:
actressSelections95PctAgg.sort_values('averageRating_y', ascending=False, inplace=True)

# Top 10 Actress Ranked by Highest Movie Rating With 10 or More Films

In [17]:
actressSelections95PctAgg.head(10)

               primaryName  tconst  averageRating_y
858             Joan Allen      13         7.315385
970           Kate Winslet      19         7.210526
465           Dianne Wiest      13         7.161538
562            Emma Watson      11         7.127273
327       Catherine Keener      14         7.107143
874           Jodie Foster      16         7.081250
458           Diane Keaton      20         7.075000
612      Frances McDormand      15         7.073333
1636          Robin Wright      11         7.000000
811   Jennifer Jason Leigh      12         6.975000

In [18]:
directorSelections95Pct = castCrewSelections95Pct[castCrewSelections95Pct.category == 'director']
directorSelections95Pct.shape

(3248, 34)

In [19]:
directorSelections95PctAgg = (directorSelections95Pct.groupby('primaryName')
   .agg({'tconst':'count', 'averageRating_y': 'mean'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
directorSelections95PctAgg.shape

(1097, 3)

In [20]:
directorSelections95PctAgg.head()

           primaryName  tconst  averageRating_y
0         Aaron Blaise       1             6.80
1        Aaron Seltzer       5             2.62
2  Abdellatif Kechiche       1             7.80
3         Abel Ferrara       1             7.10
4          Adam Brooks       1             7.20

In [21]:
directorSelections95PctAgg = directorSelections95PctAgg[directorSelections95PctAgg.tconst > 10]
directorSelections95PctAgg.shape

(31, 3)

In [22]:
directorSelections95PctAgg.sort_values('averageRating_y', ascending=False, inplace=True)

# Top 10 Directors Ranked by Highest Movie Rating With 10 or More Films

In [23]:
directorSelections95PctAgg.head(10)

              primaryName  tconst  averageRating_y
824     Quentin Tarantino      12         7.891667
803         Peter Jackson      11         7.772727
662       Martin Scorsese      19         7.652632
300  Francis Ford Coppola      11         7.572727
973      Steven Spielberg      31         7.412903
474             Joel Coen      15         7.360000
287            Ethan Coen      16         7.356250
879       Robert Zemeckis      15         7.306667
845     Richard Linklater      13         7.300000
172        Clint Eastwood      11         7.227273

In [24]:
writerSelections95Pct = castCrewSelections95Pct[castCrewSelections95Pct.category == 'writer']
writerSelections95Pct.shape

(2981, 34)

In [25]:
writerSelections95PctAgg = (writerSelections95Pct.groupby('primaryName')
   .agg({'tconst':'count', 'averageRating_y': 'mean'})
   .reset_index()
   .rename(columns={'Movies Titles':'Average Rating'})
   )
writerSelections95PctAgg.shape

(1344, 3)

In [26]:
writerSelections95PctAgg.head()

      primaryName  tconst  averageRating_y
0  Aaron Harberts       1         4.800000
1  Aaron McGruder       1         5.900000
2   Aaron Seltzer       3         5.600000
3    Aaron Sorkin       6         7.216667
4  Aaron Springer       1         7.000000

In [27]:
writerSelections95PctAgg = writerSelections95PctAgg[writerSelections95PctAgg.tconst > 10]
writerSelections95PctAgg.shape

(22, 3)

In [28]:
writerSelections95PctAgg.sort_values('averageRating_y', ascending=False, inplace=True)

# Top 10 Writers Ranked by Highest Movie Rating With 10 or More Films

In [29]:
writerSelections95PctAgg.head(10)

          primaryName  tconst  averageRating_y
414        Fran Walsh      11         7.772727
445      George Lucas      12         7.591667
1208  Steven Zaillian      11         7.418182
666        John Logan      11         7.036364
1323  William Goldman      14         6.942857
1170         Stan Lee      20         6.900000
324    David S. Goyer      11         6.900000
1085     Roberto Orci      11         6.854545
1235     Terry Rossio      16         6.843750
1226      Ted Elliott      15         6.826667